Pampers/Yoneda/Yoneda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Avatars du lemme de Yoneda</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Avatars du lemme de Yoneda"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-05-03T11:11+0200"/>
<meta name="author" content="Basile Pillet"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Avatars du lemme de Yoneda</h1>


<p>
 <span class="timestamp-wrapper"> <span class="timestamp">2016-05-06 Thu 13:00</span></span><br/>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Avatars</a>
<ul>
<li><a href="#sec-1-1">1.1 Théorème de Cayley</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Enoncé</a></li>
<li><a href="#sec-1-1-2">1.1.2 Version représentations/actions de groupes</a></li>
<li><a href="#sec-1-1-3">1.1.3 Enoncé monoïde</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Un théorème de logique propositionelle</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Enoncé</a></li>
<li><a href="#sec-1-2-2">1.2.2 Preuve</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Rentrer dans les ordres</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Enoncé</a></li>
<li><a href="#sec-1-3-2">1.3.2 Compléter Q</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Propriété universelle</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Exemple (un peu original)</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 Ev et Evns</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 Yoneda</a></li>
<li><a href="#sec-1-5-2">1.5.2 Exemples</a></li>
<li><a href="#sec-1-5-3">1.5.3 Adjonctions</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 L1loc</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Philosophie(s)</a>
<ul>
<li><a href="#sec-2-1">2.1 Complétion : Le truc qui contient tous les autres</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Exemple catégorie qui n'est pas (co-)complète : Catégorie des corps.</a></li>
<li><a href="#sec-2-1-2">2.1.2 Meilleur exemple : La catégorie des anneaux</a></li>
<li><a href="#sec-2-1-3">2.1.3 Autre exemple : Ouverts d'un espace topologique.</a></li>
<li><a href="#sec-2-1-4">2.1.4 Terminologie</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Faire agir les structures mathématiques sur elles-meme</a></li>
<li><a href="#sec-2-3">2.3 Platonicisme</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 En physique</a></li>
<li><a href="#sec-2-3-2">2.3.2 Caverne de Platon</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 Grothendieck</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Enoncé propre</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Avatars</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Théorème de Cayley</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Enoncé &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Expos_">Exposé</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> Version représentations/actions de groupes</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li id="sec-1-1-2-1">G-ensemble<br/>
Une représentation de \(G\) est la donnée d'un ensemble \(E\) et pour tout \(g \in G\) d'une bijection \(E(g)\) de \(E\).

</li>
</ul>
<ul>
<li id="sec-1-1-2-2">Morphisme de G-ensemble<br/>
Un morphisme de représentation \(\phi\) entre \(E\) et \(F\) est la donnée pour tout \(g \in G\) d'une application \(\phi_g : E \to F\) tel que le diagramme commute : \(F(g) \circ \phi_g = \phi_g \circ E(g)\)

</li>
</ul>
<ul>
<li id="sec-1-1-2-3">Enoncé<br/>
Le lemme de Yoneda nous associe à chaque élément de \(G\) un morphisme de représentation entre G<sub>gauche</sub> et lui-même, qui se trouve être un automorphisme et induit donc pour \(g=e\) une bijection de \(|G|\).

</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Enoncé monoïde</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>Pareil pour les monoïdes. Pas pour les structures plus faibles !
</p>
<ul>
<li id="sec-1-1-3-1">Raison &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Bonus">Bonus</span></span><br/>
Les monoïdes sont exactement les catégories à \(1\) élément.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Un théorème de logique propositionelle</h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Enoncé &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Expos_">Exposé</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">

<p>(3)   (∀X, (X ⇒ A) ⇒ (X ⇒ B)) entraine A ⇒ B
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Preuve &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Bonus">Bonus</span></span></h4>
<div class="outline-text-4" id="text-1-2-2">

<p>On considère la catégorie des formules du premier ordre bien formées en les variables propositionelles A, B, · · · Dont les flèches sont les implications sémantiques.
</p>
<p>
Le faisceau représentable de A est l’ensemble des X tels que (X ⇒ A).
</p>
<p>
Un morphisme de faisceau entre F et G est la donnée pour tout A d’une application F (A) → G(A) naturelle en A.
L’hypothèse de (3) se traduit par l’implication X ∈ Aˆ ⇒ X ∈ Bˆ d'où l'inclusion Aˆ&lt; Bˆ donc A ∈ Bˆ donc A ⇒ B.
</p>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Rentrer dans les ordres &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Expos_">Exposé</span></span></h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Enoncé</h4>
<div class="outline-text-4" id="text-1-3-1">

<p>Soit (E, ≤) un ensemble totalement ordonné. À x on associe I(x) : l’ensemble des éléments inférieurs à x.
</p>
<p>
Et comme l’ordre est total si I(x) = I(y), alors x = y
</p>
<p>
De plus, considérons E' l’ensemble des J ⊆ E tels que si x ∈ J et y ≤ x alors
y ∈ J. Ainsi E' est l’ensemble des parties de E "stables par inférieur".
</p>
<p>
Les résultats précédents nous dises que E s’injecte dans E' .
</p>
<p>
On a de plus un ordre sur E' qui étend celui de E : J ≤ K ssi J ⊂ K.
</p>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Compléter Q</h4>
<div class="outline-text-4" id="text-1-3-2">

<p>Dans le cas E = Q munit de l’ordre usuel, on a des elements de E' qui ne correspondent pas à des I(x) pour x ∈ Q.
</p>
<p>
Exemple : J = {y ∈ Q | y 2 ≤ 2 } n’est pas de la forme I(x), mais est bien un élément de E' .
</p>
<p>
Prenons un élément J de E' , c’est une partie de Q donc de R, par suite elle est soit vide soit admet une borne supérieure finie ou infinie. Si elle admet une borne supérieure x, alors elle est de la forme {y ∈ Q | y ≤ x}.
On notera −∞ la partie vide de Q et +∞ la partie pleine.
Alors la distinction ci-dessus montre que E = R ∪ {±∞}, avec l’ordre naturel.
</p>
<p>
Remarque à Tristan, R n’est peut-être pas naturel, mais \(\bar\R\) oui
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Propriété universelle &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Expos_">Exposé</span></span></h3>
<div class="outline-text-3" id="text-1-4">

<p>Toute propriété universelle convient
Le "il existe un unique [morphisme]" provient du lemme de Yoneda.
</p>
</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Exemple (un peu original)</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>The field of fractions \(K\) of \(R\) is characterised by the following universal property: if \(h:R\rightarrow F\) is an injective ring homomorphism from \(R\) into a field \(F\), then there exists a unique ring homomorphism \(g:K\rightarrow F\) which extends \(h\).
</p>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> Ev et Evns &nbsp;&nbsp;&nbsp;<span class="tag"><span class="DUAL">DUAL</span>&nbsp;<span class="Expos_">Exposé</span></span></h3>
<div class="outline-text-3" id="text-1-5">



</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Yoneda</h4>
<div class="outline-text-4" id="text-1-5-1">

<p>Dès qu'on a une notion de dualité, on a toujours un morphisme naturel \(E \to Bidual(E)\). Ça peut paraître peu, mais le mot naturel n'est pas à prendre à la légère. Il entraîne en particulier que cette application est presque toujours injective. Et si elle ne l'est pas elle est triviale en un certain sens.
</p>
</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Exemples</h4>
<div class="outline-text-4" id="text-1-5-2">

<ul>
<li>Ev
</li>
<li>Evn
</li>
<li>Evt (avec flèche nulle si les evt ne sont pas localement convexes)
</li>
<li>Dual abélien d'un groupe (Hom(G,Z)), avec morphisme trivial sur les éléments de torsion.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> Adjonctions &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Bonus">Bonus</span></span></h4>
<div class="outline-text-4" id="text-1-5-3">

<p>\(E \to E^{**}\) unité d'une adjonction donc élément universel parmis les transformations naturelles \(id \to bidual\)
</p>
<p>
cf. <a href="https://ncatlab.org/nlab/show/adjunction">Adjunction in ncatlab</a>
</p>
</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> L1loc &nbsp;&nbsp;&nbsp;<span class="tag"><span class="DUAL">DUAL</span></span></h3>
<div class="outline-text-3" id="text-1-6">


<p>
"A locally integrable function on an open domain is determined by the knowledge of the values of the integrals against test functions"
</p>
<ul>
<li id="sec-1-6-1">Référence &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Ref">Ref</span></span><br/>
Theory and Applications of Categories, Vol. 23, No. 12, 2010, pp. 243–250.
A CATEGORICAL APPROACH TO INTEGRATION
by REINHARD B ORGER

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Philosophie(s)</h2>
<div class="outline-text-2" id="text-2">


<p>
Les flèches * -&gt; A sont exactement les éléments de A.
L'ensemble des flèches B -&gt; A donc noté Hom(B,A), représente donc les B-points de A. Une forme généralisée de points.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Complétion : Le truc qui contient tous les autres</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Exemple catégorie qui n'est pas (co-)complète : Catégorie des corps.</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>Un produit de corps n'est pas forcément un corps.
Un préfaisceau de corps est la donnée pour tout sous-corps d'un ensemble qui respectent les inclusions.
Ces inclusions forment un \(G\)-ensemble sous l'action d'un groupe (Automorphismes/Galois)
</p>
</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Meilleur exemple : La catégorie des anneaux</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>Si on la voit comme un catégorie enrichie sur les \(\Z\)-modules (préadditive) et qu'on prend les foncteurs qui correspondent, alors la catégorie des préfaisceaux est celles des Modules-à-droite-sur-un-anneaux, et l'énoncé de Yoneda donne (pour tout M, R-module à droite)
\[
M \simeq Hom_{R}(R,M)
\]
La catégorie des modules est abélienne (mieux que préadittive)
</p>
</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Autre exemple : Ouverts d'un espace topologique.</h4>
<div class="outline-text-4" id="text-2-1-3">

<p>Il y a un ensemble vide (initial) et un ensemble plein (terminal) mais une intersection quelconque d'ouverts n'existe pas toujours dans la catégorie des ouverts. Ça peut par exemple être un singleton. Mais du point de vue de la catégorie, elle voit que les ouverts dedans (ie vide). Ainsi même si notre topologie est assez fine pour repérer les points, la catégorie associée ne les voit pas.
Par contre la catégorie des (pré-)faisceaux oui : avec les faisceaux gratte-ciel
</p>
</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Terminologie</h4>
<div class="outline-text-4" id="text-2-1-4">

<ul>
<li id="sec-2-1-4-1">Représentable<br/>
Truc de la catégorie complété qui provient en fait de la petite catégorie de départ.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Faire agir les structures mathématiques sur elles-meme</h3>
<div class="outline-text-3" id="text-2-2">



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Platonicisme</h3>
<div class="outline-text-3" id="text-2-3">

<p>&gt; Un objet c d'une catégorie est entièrement décris par Hom(_,c)
</p>
<p>
C'est-à-dire connaitre un objet c'est savoir comment il interragit avec les autres.
</p>

</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> En physique</h4>
<div class="outline-text-4" id="text-2-3-1">

<blockquote>

<p>You work at a particle accelerator. You want to understand some particle. All you can do are throw other particles at it and see what happens. If you understand how your mystery particle responds to all possible test particles at all possible test energies, then you know
everything there is to know about your mystery particle.  &ndash; Ravi Vakil
</p>
</blockquote>


<p>
Mettons qu'on travaille dans un accélérateur de particules. On veut comprendre une nouvelle particule. Tout ce qu'on peut faire c'est lancer d'autres particules dessus et observer ce qu'il se passe. Si on comprend comment notre particule mystérieuse réagit à chaque particule test qu'on lui lance à chaque niveau d'énergie possible, alors on sait tout ce qu'il y a savoir sur notre particule mystérieuse
</p>
</div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Caverne de Platon</h4>
<div class="outline-text-4" id="text-2-3-2">

<p>La réalité n'est déterminé que par l'ensemble des projections dont on dispose.
</p>
<blockquote>

<p>lorsque tu travailles sur un objet géométrique, par exemple une sphère, tu n’imagines jamais l’objet intrinsèquement, tu le vois toujours comme plongé dans un R<sup>n</sup> , tu regardes les fonctions dessus, et même lorsque tu l’observes tu en fais des projections sur ta rétine, donc tu ne considère jamais l’objet intrinsèquement mais que les fonctions sur celui ci. &ndash; Aurélien Sagnier
</p>
</blockquote>


<p>
Cependant
</p><blockquote>

<p>Ce lemme a inspiré nombre de gloses et d’interprétations. L’interprétation perspectiviste, qui énonce qu’« un objet s’identifie à l’intégrale des points de vue sur cet objet », est éclairante, mais guère rigoureuse : il faudrait en effet convenir que les « points de vue » réciproques sont les morphismes de la catégorie que l’on considère ; or il semble difficile d’admettre que la composition d’un point de vue de A sur B avec un point de vue de B sur C détermine un point de vue de A sur C, comme il serait requis dans une catégorie&hellip;
</p>
<p>
On voit bien sur cet exemple les difficultés des généralisations philosophiques d’énoncés mathématiques, qui ne laissent pas d’être éclairantes en dépit de leurs incohérences en tant qu’interprétations.
</p>
<p>
[&hellip;Il faut aussi&hellip;] insister sur le fait que le point de vue de l’objet sur lui-même, crucial dans la démonstration du lemme, fait partie de l’intégrale, ce qui censure bien des gloses abusives.
</p>
</blockquote>


</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Grothendieck</h3>
<div class="outline-text-3" id="text-2-4">

<p>Les catégories de préfaisceaux sont parfaites : On peut faire des maths/de la logique dedans comme quand on travaille avec des ensembles (presque : logique constructiviste)
Leurs seuls défauts : Elles sont trop grosses&hellip; Beaucoup beaucoup. Exemple si on prend la catégorie des ouverts d'un espace topologique, un préfaisceau est la donnée pour chacun de ces ouverts d'un ensemble + restrictions. C'est bien trop vaste pour qu'on puisse le voir comme "une généralisation des ouverts de l'espace topologique"
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Enoncé propre &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Bonus">Bonus</span></span></h2>
<div class="outline-text-2" id="text-3">

<p>There is a contravariant version of Yoneda's lemma, which concerns contravariant functors from \(C\) to \(Set\). This version involves the contravariant hom-functor
\[
h_A = \mathrm{Hom}(-, A),
\]
which sends \(X\) to the hom-set \(Hom(X,A)\). Given an arbitrary contravariant functor \(G\) from \(C\) to \(Set\), Yoneda's lemma asserts that
\[
\mathrm{Nat}(h_A,G) \cong G(A). 
\]
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-05-03T11:11+0200</p>
<p class="author">Author: Basile Pillet</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
